In [15]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
df = pd.read_csv("../data/train.csv", index_col=0)

In [17]:
df.head()

                                                 Sequence
Id
222447  10,11,12,13,14,15,16,17,18,19,1011,21,1112,111...
126500  1,0,2,0,0,6,0,0,0,21,0,0,0,3,79,0,0,0,0,41,311...
217366  1,2,4,8,15,30,58,114,225,443,871,1715,3375,664...
4216    1,2,12,432,31104,6718464,8707129344,2256887925...
65934   1,2,0,3,0,0,1,4,1,0,2,0,0,2,0,5,0,2,0,0,0,4,2,...

In [18]:
df.shape

(79692, 1)

In [19]:
df.Sequence.str.count(',')

Id
222447     46
126500     74
217366     28
4216       11
65934     104
159343     12
123002     66
97896      21
142247     89
161798     69
183649     15
20812      47
112430     74
208564     36
12078       9
175359     51
69478      56
44292      20
71108      57
225        98
49353      59
226078     71
20239      37
22060     104
7879       23
29463      59
172441     29
226299     72
192490     83
161210     20
         ...
127321      9
16232      60
170301     89
84846      23
227002     54
174503     17
128289     85
217071     98
116956     49
176193     46
145597     49
39196      65
131479     20
192666     17
137581      3
39545      49
83845      32
130070      5
83470     104
88516      18
226308     13
97256      13
84237      18
128184     18
201357      4
212        13
176875     27
149761     36
82336      81
161099     21
Name: Sequence, Length: 79692, dtype: int64

In [20]:
df['numbers'] = df.Sequence.str.split(',').map(np.float64)

In [21]:
df['terms'] = df.Sequence.str.count(',') + 1

In [22]:
df.head()

,Sequence,numbers,terms
Id,,,
222447,"10,11,12,13,14,15,16,17,18,19,1011,21,1112,111...","[10.0, 11.0, 12.0, 13.0, 14.0, 15.0, 16.0, 17....",47
126500,"1,0,2,0,0,6,0,0,0,21,0,0,0,3,79,0,0,0,0,41,311...","[1.0, 0.0, 2.0, 0.0, 0.0, 6.0, 0.0, 0.0, 0.0, ...",75
217366,"1,2,4,8,15,30,58,114,225,443,871,1715,3375,664...","[1.0, 2.0, 4.0, 8.0, 15.0, 30.0, 58.0, 114.0, ...",29
4216,"1,2,12,432,31104,6718464,8707129344,2256887925...","[1.0, 2.0, 12.0, 432.0, 31104.0, 6718464.0, 87...",12
65934,"1,2,0,3,0,0,1,4,1,0,2,0,0,2,0,5,0,2,0,0,0,4,2,...","[1.0, 2.0, 0.0, 3.0, 0.0, 0.0, 1.0, 4.0, 1.0, ...",105